---
kind: method
id: M:Autodesk.Revit.DB.ScheduleFilter.GetDoubleValue
source: html/9c1cce12-0cf2-35d6-0a3d-fe9caff8faf0.htm
---
# Autodesk.Revit.DB.ScheduleFilter.GetDoubleValue Method

Gets the filter value for a filter using a double value.

## Syntax (C#)
```csharp
public double GetDoubleValue()
```

## Returns
The filter value.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The filter value is not a double.